{
  "title": "Projects",
  "subtitle": "These are some of the projects I have worked on. Each one has been an opportunity to learn new technologies, strengthen my skills, and apply them to build innovative and functional solutions.",
  "viewProject": "View Project",
  "comingSoon": "Coming Soon",
  "completed": "Completed",
  "development": "In Development",
  "showLess": "Show Less",
  "showMore": "Show More",
  "viewRepository": "View Repository",
  "projectsList": [
    {
      "title": "Piranha Planner – Landing Page",
      "description": "A modern and fully responsive landing page built with React and Vite to showcase the core features of Piranha Planner.",
      "link": "https://piranhaplannerl.netlify.app/",
      "repository": "https://github.com/Privado11/PiranhaPlannerLandingPage",
      "tech": ["Vite + React", "Tailwind CSS", "ShadCN"],
      "status": "completed",
      "release": "stable",
      "imageKey": "landingPageEn"
    },
    {
      "title": "Piranha Planner",
      "description": "A collaborative task management platform built with React and Supabase. It includes user authentication, task sharing, comments, file uploads, messaging, notifications, and productivity analytics.",
      "link": "https://piranhaplanner.netlify.app/",
      "repository": "https://github.com/Privado11/PiranhaPlanner",
      "tech": ["Vite + React", "Tailwind CSS", "Supabase", "ShadCN"],
      "status": "completed",
      "release": "beta",
      "imageKey": "piranhaPlannerEn"
    },
    {
      "title": "Mobility Management System — Administrative Platform",
      "description": "Professional web platform built with Angular for managing mobility and traffic-related processes. I worked as the frontend developer, implementing all UI screens, navigation, reusable components, forms, and API integration. The system includes modules for traffic ticket management, auditing, devices, PDF report generation, user administration, and a general dashboard. Developed under a microfrontend architecture using Module Federation to ensure scalable, decoupled, and maintainable integration across different parts of the platform. Built with a modular architecture, centralized services, and custom styling using pure CSS.",
      "link": "https://appcentral.shell.sapenlinea.com.co/login",
      "repository": "",
      "tech": [
        "Angular",
        "TypeScript",
        "CSS",
        "REST API",
        "JWT",
        "Microfrontends",
        "Module Federation"
      ],
      "status": "completed",
      "release": "stable",
      "imageKey": "plataformaCentral"
    },

    {
      "title": "Conecta Ciudad — Frontend Platform",
      "description": "Frontend development of Conecta Ciudad, a digital platform for citizen participation and community project governance. Implemented UI flows, project listings, voting screens, role-based navigation, and public transparency modules. The focus was delivering a clean, accessible and responsive interface that integrates smoothly with backend services and supports traceability and secure participation.",
      "link": "https://conecta-ciudad.netlify.app/",
      "repository": "https://github.com/Privado11/conecta-ciudad",
      "tech": ["React", "Vite", "TypeScript", "Tailwind CSS", "ShadCN"],
      "status": "completed",
      "release": "stable",
      "imageKey": "conectaCiudadFrontend"
    },

    {
      "title": "Conecta Ciudad — Backend Services & Governance",
      "description": "Backend for the Conecta Ciudad platform, implementing user identity management, roles and permissions, project creation flows, voting logic, auditing mechanisms, notifications, and fully traceable processes. Built with a strong focus on security, integrity, and transparent data handling. Includes audit logs, validation workflows, and business rules ensuring reliable citizen participation.",
      "link": "https://conecta-ciudad-api.azurewebsites.net/",
      "repository": "https://github.com/Privado11/conecta_ciudad/tree/dev",
      "tech": [
        "Spring Boot",
        "Java",
        "PostgreSQL",
        "JWT",
        "REST API",
        "Audit Logs",
        "Docker",
        "CI/CD"
      ],
      "status": "completed",
      "release": "stable",
      "imageKey": "conectaCiudadBackend"
    },

    {
      "title": "Medical Appointment Management — Fullstack System",
      "description": "A fullstack system designed to efficiently manage medical appointments with authentication, role-based access (administrator, doctor, patient), scheduling, medical records, notifications, and dashboards. Developed following best practices for clean architecture, security, and scalability, with independent frontend and backend deployments.",
      "link": "",
      "repositoryFrontend": "",
      "repositoryBackend": "",
      "tech": ["React", "Vite", "Spring Boot", "Java", "PostgreSQL", "JWT"],
      "status": "planned",
      "release": "alpha",
      "imageKey": "project3Preview"
    }
  ]
}
